#### Terraform Plan 📖

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.test_config will be created
  + resource "local_file" "test_config" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./generated/test-config.json"
      + id                   = (known after apply)
    }

  # null_resource.simple_test will be created
  + resource "null_resource" "simple_test" {
      + id       = (known after apply)
      + triggers = {
          + "app_name"       = "my-test-app"
          + "config_content" = (known after apply)
        }
    }

  # random_integer.port will be created
  + resource "random_integer" "port" {
      + id     = (known after apply)
      + max    = 9000
      + min    = 8000
      + result = (known after apply)
    }

  # random_string.app_suffix will be created
  + resource "random_string" "app_suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_instance_id  = (known after apply)
  + app_name         = "my-test-app"
  + config_file_path = "./generated/test-config.json"
  + environment      = "dev"
  + random_port      = (known after apply)
  + random_suffix    = (known after apply)

```

*Pusher: @alexg84, Action: `pull_request`*

**Available Atlantis Commands:**
- `atlantis plan` - Run terraform plan
- `atlantis apply` - Run terraform apply
- `atlantis help` - Show help
